In [2]:
from numpy import nan as NA
import pandas as pd
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [4]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
clearned = data.dropna()

In [10]:
clearned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [26]:
import numpy as np
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.830283 -0.797226  0.480032
1 -0.812608 -0.281214 -1.816928
2  0.734637 -0.797607 -2.182941
3 -0.404494  0.951286 -0.903005
4  0.602674  0.431783 -1.339022
5  1.594106 -1.187005 -0.962290
6 -1.180499  0.167282  0.075595

In [27]:
df.iloc[:4, 1] = NA
df

          0         1         2
0 -0.830283       NaN  0.480032
1 -0.812608       NaN -1.816928
2  0.734637       NaN -2.182941
3 -0.404494       NaN -0.903005
4  0.602674  0.431783 -1.339022
5  1.594106 -1.187005 -0.962290
6 -1.180499  0.167282  0.075595

In [31]:
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.830283       NaN       NaN
1 -0.812608       NaN       NaN
2  0.734637       NaN -2.182941
3 -0.404494       NaN -0.903005
4  0.602674  0.431783 -1.339022
5  1.594106 -1.187005 -0.962290
6 -1.180499  0.167282  0.075595

In [32]:
df.dropna()

          0         1         2
4  0.602674  0.431783 -1.339022
5  1.594106 -1.187005 -0.962290
6 -1.180499  0.167282  0.075595

In [35]:
df.dropna(thresh=3)

          0         1         2
4  0.602674  0.431783 -1.339022
5  1.594106 -1.187005 -0.962290
6 -1.180499  0.167282  0.075595

In [38]:
df.fillna(2)

          0         1         2
0 -0.830283  2.000000  2.000000
1 -0.812608  2.000000  2.000000
2  0.734637  2.000000 -2.182941
3 -0.404494  2.000000 -0.903005
4  0.602674  0.431783 -1.339022
5  1.594106 -1.187005 -0.962290
6 -1.180499  0.167282  0.075595

In [39]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -0.830283  0.500000  0.000000
1 -0.812608  0.500000  0.000000
2  0.734637  0.500000 -2.182941
3 -0.404494  0.500000 -0.903005
4  0.602674  0.431783 -1.339022
5  1.594106 -1.187005 -0.962290
6 -1.180499  0.167282  0.075595